# Step 7: Enable Fanout and DRC Fixing
setOptMode -fixFanoutLoad true -fixDRC true

# Step 8: Final Post-CTS DRV Optimization
optDesign -postCTS -drv

timeDesign -postCTS

# Step 6: Post-CTS Optimization (Hold)
optDesign -postCTS -hold

# Step 2: Post-CTS Timing Analysis (Hold)
timeDesign -postCTS -hold





# Step 7: Enable Fanout and DRC Fixing
setOptMode -fixFanoutLoad true -fixDRC true

# Step 8: Final Post-CTS DRV Optimization
optDesign -postCTS -drv

timeDesign -postCTS

# Step 6: Post-CTS Optimization (Hold)
optDesign -postCTS -hold

# Step 2: Post-CTS Timing Analysis (Hold)
timeDesign -postCTS -hold





# Step 7: Enable Fanout and DRC Fixing
setOptMode -fixFanoutLoad true -fixDRC true

# Step 8: Final Post-CTS DRV Optimization
optDesign -postCTS -drv

timeDesign -postCTS

# Step 6: Post-CTS Optimization (Hold)
optDesign -postCTS -hold

# Step 2: Post-CTS Timing Analysis (Hold)
timeDesign -postCTS -hold




